'''1. Напишите программу, которая генерирует случайное число от 1 до 100,
а затем предлагает пользователю угадать это число. Если пользователь угадывает число,
программа выводит сообщение о победе. Если пользователь не угадывает число, программа сообщает, больше или меньше загаданное число и предлагает попробовать снова. Используйте цикл с инструкцией break, чтобы остановить выполнение цикла, когда число угадано.


Пример вывода:


Угадайте число от 1 до 100: 50

Загаданное число меньше.

Попробуйте снова: 75

Загаданное число больше.

Попробуйте снова: 63

Поздравляю! Вы угадали число 63!
'''




